import React from 'react';
import CardsPartnersTemp from "./cards-partners-template";

/**Карточки "Наши партнёры"
 * Используют встроенный svg для управления цветом логотипов. Компонент
 * CardsPartnersTemp задаёт цвет свойству fill всех path, являющихся
 * прямыми потомками <svg>
 * <svg>
 *  <path d="..." fill="значение"></path>
 *  <path d="..." fill="значение"></path>
 *  <path d="..." fill="значение"></path>
 * </svg>
*/

function EcoLab(props) {
    const height = props.mobile ? 73 : 94;
    const width = props.mobile ? 73 : 94;

    const logo = (
        <svg width={width} height={height} viewBox="0 0 94 94" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M46.9998 5.22232C28.1998 4.43899 12.5331 19.0612 11.7498 37.8612C10.9665 56.6612 25.5887 72.3279 44.3887 73.1112V59.5334L30.8109 45.9557C29.7665 44.9112 29.7665 43.3445 30.8109 42.3001C31.8553 41.2557 33.422 41.2557 34.4665 42.3001L44.3887 52.2223V36.0334L37.3387 28.9834C36.2942 27.939 36.2942 26.3723 37.3387 25.3279C38.3831 24.2834 39.9498 24.2834 40.9942 25.3279L49.6109 33.9445V41.7779L58.2276 33.1612C59.272 32.1168 60.8387 32.1168 61.8831 33.1612C62.9276 34.2057 62.9276 35.7723 61.8831 36.8168L49.6109 49.089V73.1112C68.4109 72.3279 83.0331 56.6612 82.2498 37.8612C81.4664 19.0612 65.7998 4.43899 46.9998 5.22232Z" fill="#3D3D3D"/>
            <path d="M46.9998 73.1111H44.3887V86.1666C44.3887 87.7333 45.4331 88.7777 46.9998 88.7777C48.5665 88.7777 49.6109 87.7333 49.6109 86.1666V73.1111H46.9998Z" fill="#3D3D3D"/>
        </svg>
    );
    const text = <div>Эколаборатория</div>;

    return(
        <CardsPartnersTemp mobile={props.mobile} active={props.active} logo={logo} text={text}/>
    );
}

export default EcoLab;